SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( DR_BR_L1_67709
	Type ( Engine )
	WagonShape ( DR_BR_L1_67709.s )
	
	Size  ( 2.727027m 4.005943m 13.097692m )
	CentreOfGravity ( 0.0m 0.0m 0.0m )
	Centre ( 0.00m 0.00m -0.00m )
	Mass ( 89.45t )
	FreightAnim ( DR_BR_L1_Extras.s -0.1 0.1 )
	InertiaTensor ( Box(2.727027m 4.005943m 13.097692m) )
		Coupling (
		Type ( Chain )
		Spring (
			Stiffness ( 1e6N/m 2e6N/m )
			Damping ( 1e6N/m 1e6N/m )
			Break ( 1e8N 1e8N )
			r0 ( 20cm 40cm )
		)
	)
	Coupling (
		Type ( Chain )
		Spring (
			Stiffness ( 1e6N/m 2e6N/m )
			Damping ( 1e6N/m 1e6N/m )
			Break ( 1e8N 1e8N )
			r0 ( 20cm 40cm )
		)
	)
	Buffers (
		Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 1e6N/m/s 1e6N/m/s )
			r0 ( 0cm 1e9 )
		)
		Centre ( 1.5 )
		Radius ( 1 )
		Angle ( 2.5deg )
	)      
	Inside (
        PassengerCabinFile ( DR_BR_L1_67709.s )
        PassengerCabinHeadPos ( 1.5 3.1 -2.8 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
	IntakePoint ( 0.7 2.4 FuelWater )
	IntakePoint ( -1.99 2.73 FuelCoal )
	Adheasion ( 0.15 0.3 0.4 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 240kN )
	DerailBufferForce ( 400kN )
	WheelRadius ( 0.47m )
	NumWheels ( 1 )
	Friction (
			5000.0N/m/s			-0.10		1.0mph	  14.108N/m/s		1.828
			5.1N/rad/s		1		-1rad/s		0		1
			)
	BrakeEquipmentType( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
	BrakeSystemType( "Vacuum_single_pipe" )
	MaxBrakeForce( 90kN )
	MaxHandbrakeForce( 80kN )
	NumberOfHandbrakeLeverSteps( 100 )
	MaxReleaseRate( 10 )
	MaxApplicationRate( 10 )
	MaxAuxilaryChargingRate( 10 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )        
	Sound (	"..\\..\\Common.Sound\\2cyl_generic\\2c-100b-engpas_L1.sms" )

)

Engine ( DR_BR_L1_67709  
	Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.269 3.642 -1.214
				0 0.8 0
				0.2
			)

			SafetyValvesFX
			(
				0 3.772 -0.567
				0 0.95 0
				0.2
			)
			SafetyValvesFX
			(
				0 3.772 -0.567
				0 -0.8 0
				0.35
			)
			StackFX
			(
				0 4.000 4.418
				0 0.95 0
				0.3
			)
			StackFX
			(
				0 4.000 4.418
				0 0.95 0
				0.25
			)
			StackFX
			(
				0 4.000 4.418
				0 0.95 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-1.026 0.318 4.876
				0 -0.4 1.4
				0.1
			)

			CylindersFX
			(
				1.026 0.318 4.876
				0 -0.4 1.4
				0.1
			)
		)
	)

	Wagon ( DR_BR_L1_67709 )
	Type ( Steam )
	IsTenderRequired( -1 )	                             comment( a typical MSTS-bug. “-1” is the correct value for tank engines)
	MaxPower ( 1500kW )                                  comment(of course, this value is too high)
	MaxForce ( 32080lbf )                                comment(looks like an approximate real value)
	MaxVelocity ( 80mph )                                comment(MSTS accepts values in mph and kmh)
	WheelRadius ( 0.925m )                               comment(puzzling parameter. Sometimes MSTS uses radius, sometimes diameter. You have test it. This parameter is necessary for the virtual rotation speed of the driving wheels)
	NumCylinders ( 2 )                                   comment(out of function)
	Sanding ( 1e9mph )                                   comment(out of function)
	NumWheels ( 1 )                                      comment(keep in mind, MSTS is counting herein axles)
	BoilerLength ( 3.0m )                                comment(estimated value. Keep in mind, boilers always are not very long)
	BoilerVolume ( "125*(ft^3)" )                        comment(this value doesn’t touch the simulation)
	BoilerEffectivity ( 1.26 )
	BoilerResponsiveness ( 1.22 )
	CoalBurnage ( 5.0lb/hp/h )                           comment(if you get problems firing the engine, set it to a lower value)
	MaxBoilerOutput ( 27000lb/h )                        comment(estimated value. Its very much)
	ExhaustLimit ( 27000lb/h )
	MaxBoilerPressure ( 225psi )
	SuperHeater ( 1.05 )                                 comment( very important setting, determins steam production and usage.)
	SafetyValvesSteamUsage ( 9000lb/h )                  comment(more than 10000 is without any effect)
	SafetyValvePressureDifference( 15 )                  comment(choose a higher value, I suggest “15”)
	PrimingFactor ( 1 )                                  comment ( how big the impact of priming happens )
	SteamMinPrimingLevel ( 1 )                           comment ( when priming happens )
	SteamPrimingReductionWithCylinderCocksOpen ( 0.5 )   comment ( decrease of priming by open cylinder cocks )
	SteamPrimingPowerLossProportion ( 0.9 )              comment ( how much steam is wasted )
	SteamPrimingWaterUsageIncreaseProportion ( 5 )       comment  ( how much water is lost )
	CylinderStroke ( 26in )                              comment(this value doesn’t affect the simulation)
	CylinderDiameter ( 20in )                            comment(this value doesn’t affect the simulation)
	CylinderVolume ( "12.8*(ft^3)" )                     comment(change this value if needed. MSTS isn’t using the entire formula. I very recommend doubling this value. Steam engines are reciprocing engines. If you double this value, you’ll get real water consumption.)
	CylinderEffectivity ( 1.4 )                          comment(how good the cylinders work)
	CylinderCocksPowerEfficiency ( 0.8 )                 comment(use this value for visible effect)
	SteamCylinderCocksOperation( Manual )
	MaxFireMass ( 850lb )
	IdealFireMass ( 850lb )                              comment(max. steam production)
	MaxWaterMass ( 800lb ) 
	BasicSteamUsage ( 1000lb/h )                         comment(Steam usage if engine idles)
	BasicCoalUsage ( 850lb/h )                           comment(the used coal mass for that)
	ShovelCoalMass ( 1lb )                               comment(that determines how much the fire cools down)
	SteamFiremanMaxPossibleFiringRate(4414)              comment(undocumented function, effect only on high values) 
	MaxTenderCoalMass ( 89600lb )
	MaxTenderWaterMass ( 26300lb )
	SteamMaxSmokeUnitsReleaseRate( 2 )                   comment (very small values change the exhaust white)
	SteamSmokeUnitsPerPoundOfFuel( 2 )                   comment(output of steam depending on traction)

	MaxSteamHeatingPressure( 80 )                        comment(the pressure in the heating pipe)

	InjectorTypes( 0 1 )
	InjectorSizes ( 10mm 20mm # water supply )
	Injector1FeedrateMultiplierLive ( 0.25 ) 
	Injector2FeedrateMultiplierExhaust ( 0.5 )
	Injector1WaterValveVariance ( 0.75 )
	Injector2WaterValveVariance ( 0.75 )
	InjectorLimits1 ( 60psi  0.5 1 )  
	InjectorLimits2 ( 80psi 0.6 1 )
	
	CutoffMaxReverse ( -0.75 )                          comment(necessary for a tank engine) 
	CutoffMaxForward ( 0.75 )                           comment(useful if you wish other higher values)
	SteamSmallestCutoff( 0.8 )                          Comment(the original value was very wrong)

	RegulatorValveType( Twin_port )
	RegulatorPilotValveExponent( 1 )
	RegulatorPilotValveInitialOpening( 0.1 )
	RegulatorPilotValveFullOpening( 0.5 )
	RegulatorSecondValveExponent( 2 )
	RegulatorSecondValveStartPosition( 0.55 )
	RegulatorMainValveInitialOpenning( 0.55 )

	SteamBlowerEffectExponent( 0.8 )                   comment(how much the blower affects the fire)
	SteamBlowerEfficiencyExponent( 1.1 )
	SteamBlowerMaxSteamUsageRate( 500 )	           comment( lbs/h )
	SteamBlowerMaxProportionOfBlastEffect( 0.45 )
	BlastExponent ( 0.87 )                             comment(How sharply the exhaust steam affects the fire)
	DraftingEffect ( 0.8 )                             comment(lower this value for lazy firemen)

        VacuumBrakesSmallEjectorPowerRating( 50 )
	VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
	VacuumBrakesSmallEjectorUsageRate( 2400 )
	VacuumBrakesLargeEjectorUsageRate( 2400 )
	VacuumBrakesHasVacuumPump( 0 )

	TrainBrakesControllerMaxReleaseRate( 3.0 )
	TrainBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMaxSystemPressure( 21 )

	EngineBrakesControllerHasProportionalBrake( 1 )
        EngineBrakesProportionalBrakeLag( 0.9 )

	BrakesEngineBrakeType( "Vacuum_single_pipe"  )
	BrakesTrainBrakeType( "Vacuum_single_pipe" )
        BrakesEngineControllers( "Hand, Train" )
	
	NumberOfDamperSteps( 4 )
	SteamGaugeGlassHeight( 10 )                        comment(cryptic)
	SmokeCombustion ( 1 )

	Cabview ( B1.cvf )
	HeadOut (  -1.5 3.1 -2.8 )

        EngineControllers (

            Regulator ( 0 1 0.05 0
                NumNotches ( 0 )
            )
            Cutoff    ( -0.75 0.75 0.05 0
                NumNotches ( 0 )
            )
            Brake_Train ( 0 0.99 0.0475 0.65
	    NumNotches( 3
 	    Notch( 0 1 TrainBrakesControllerReleaseStart )
	    Notch( 0.05 1 TrainBrakesControllerRunningStart )
	    Notch( 0.3 1 TrainBrakesControllerApplyStart )
	    )
	    )


            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 0 1 0.075 1 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.035 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	1 Dummy )
                   	Notch ( 0.5	  	1 Dummy )
                   	Notch ( 0.75   	1 Dummy )
                   	Notch ( 1   	1 Dummy )
				
			)
            )
            Shovel ( 0 1 1 0 
                NumNotches( 6 
				Notch ( 0     	0 Dummy )
				Notch ( 0.25     	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )
                   	Notch ( 2   	0 Dummy )
				
			)
            )
            DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 6 
                		Notch ( 0     	0 Dummy )
                   	Notch ( 0.15   	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
				Notch ( 1		0 Dummy )
			)
		)
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
		)
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

	comment(fire temp, fire mass, water mass, boiler pressure,
		water level, tender_water_mass, tender_coal_mass,
		smoke_quantity, fire_condition, coal quality )
		
	EngineVariables( 850 850 750 227 0.75 3000 0.95 0.9 1 0.95 )
	Sound (	"..\\..\\Common.Sound\\2cyl_generic\\2c-100b-cab_L1.sms" )
    	Name ( "DR_BR_L1_67709" )
 	Description (
 	""

	)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key several times to move the Reverser to full Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the D key to increase the Regulator setting.\n"+  
	"4.	As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the Regulator to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
	"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
	"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key several times to move the Reverser to the full Reverse position.\n"+
	"4.	Press the ; (SEMICOLON) key to release the brakes.\n"+
	"5.	Slowly advance the regulator (D key).\n\n"+
	"To load and unload passengers\n"+
	"1. Stop at a station.\n"+
	"2. Press the ENTER key.\n"+
	"3. Wait for the \"permission to depart\" whistle.\n"+
	"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window.\n\n"+
	"Firing commands (Automatic Fireman OFF in Options screen)\n"+
	"To add coal to the firebox\n"+
	"1. Press the F key to open the Firebox door.\n"+
	"2. Press the R key to increase the shoveling rate.\n\n"+
	"To stop adding coal to the fire\n"+
	"1. Press SHIFT+R to decrease the shoveling rate.\n"+
	"2. Press SHIFT+F to close the firebox door.\n\n"+
	"To operate the blower\n"+
	"1.	Press the N key to increase the blower.\n"+
	"2. Press SHIFT+N to decrease the blower.\n\n"+
	"To operate the dampers\n"+
	"1.	Press the M key to open the dampers.\n"+
	"2. Press SHIFT+M to close the dampers.\n\n"+
	"To inject water into the boiler\n"+
	"1.	Press the I key to turn on the steam to Injector 1.\n"+
	"(You can also press the O key to turn on the steam to Injector 2.)\n"+
	"2.	Press the K key to increase the water flow to Injector 1.\n"+
	"(To increase the water flow to Injector 2, press the L key.)\n\n"+
	"To stop boiler water injection\n"+ 
	"1. Press the I key to turn off the steam to Injector 1.\n"+
	"2. Press the O key to turn off the steam to Injector 2."
	)
)
